app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", ""], ["body", ""], ["created_at", "2018-05-29 06:59:58.633773"], ["updated_at", "2018-05-29 06:59:58.633773"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "blogs"."id" = $4  [["title", "ชาตังกู เริ่มขายเมื่อไร"], ["body", "ฟกฟกกฟดฟกฟกดฟกดฟดฟกฟฟกดฟฟดฟด"], ["updated_at", "2018-05-29 07:00:38.350120"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)